Repository: Geoege-xll/quotio
Catalog: Quotio/Localizable.xcstrings
Source language: en
Languages: fr, vi, zh_hans, zh_hant

# callReplica.sourceHelp
source: About call data
fr: À propos des appels
vi: Về dữ liệu lượt gọi
zh_hans: 关于调用数据

# callReplica.sources
source: Data Sources
fr: Sources des données
vi: Nguồn dữ liệu
zh_hans: 数据来源

# callReplica.total
source: Total Calls
fr: Total des appels
vi: Tổng lượt gọi
zh_hans: 总调用

# callReplica.unused
source: No recorded calls
fr: Aucun appel enregistré
vi: Chưa ghi nhận lượt gọi
zh_hans: 无调用记录

# callReplica.unusedSkills
source: Unused Skills
fr: Skills inutilisés
vi: Skill chưa gọi
zh_hans: 未调用技能

# callReplica.used
source: Used
fr: Utilisé
vi: Đã gọi
zh_hans: 已调用

# callReplica.zero.description
source: Installed tools without recorded calls in the selected period
fr: Éléments installés sans appel enregistré sur la période
vi: Mục đã cài chưa ghi nhận lượt gọi trong khoảng chọn
zh_hans: 所选时间内已安装但未记录调用的项目

# callReplica.zero.title
source: Zero-Call Detection
fr: Détection sans appel
vi: Phát hiện chưa gọi
zh_hans: 零调用检测

source: Choose Your Proxy
fr: Choisissez votre proxy
vi: Chọn proxy của bạn
zh_hans: 选择你的代理

# clinepass.error.modelsRequired
source: Select at least one ClinePass model
fr: Sélectionnez au moins un modèle ClinePass
vi: Chọn ít nhất một model ClinePass
zh_hans: 请至少选择一个 ClinePass 模型

# clinepass.error.singleKey
source: ClinePass requires exactly one API key per account
fr: ClinePass nécessite exactement une clé API par compte
vi: ClinePass yêu cầu đúng một khóa API cho mỗi tài khoản
zh_hans: 每个 ClinePass 帐户必须且只能配置一个 API 密钥

# clinepass.quota.fiveHour
source: 5-hour
fr: 5 heures
vi: 5 giờ
zh_hans: 5 小时

# clinepass.quota.monthly
source: Monthly
fr: Mensuel
vi: Hàng tháng
zh_hans: 每月

# clinepass.quota.weekly
source: Weekly
fr: Hebdomadaire
vi: Hàng tuần
zh_hans: 每周

source: Continue
fr: Continuer
vi: Tiếp tục
zh_hans: 继续

source: Cooling
fr: Refroidissement
vi: Đang làm mát
zh_hans: 冷却中

# customProviders.add
source: Add Custom Provider
fr: Ajouter un fournisseur personnalisé
vi: Thêm nhà cung cấp tùy chỉnh
zh_hans: 添加自定义提供商

# customProviders.addHeader
source: Add Header
fr: Ajouter un en-tête
vi: Thêm header
zh_hans: 添加标头

# customProviders.addKey
source: Add Key
fr: Ajouter une clé
vi: Thêm khóa
zh_hans: 添加密钥

# customProviders.addMapping
source: Add Mapping
fr: Ajouter un mappage
vi: Thêm ánh xạ
zh_hans: 添加映射

# customProviders.addProvider
source: Add Provider
fr: Ajouter le fournisseur
vi: Thêm nhà cung cấp
zh_hans: 添加提供商

# customProviders.allModels
source: All Models
fr: Tous les modèles
vi: Tất cả mô hình
zh_hans: 全部模型

# customProviders.apiKeys
source: API Keys
fr: Clés API
vi: Khóa API
zh_hans: API 密钥

# customProviders.baseURL
source: Base URL
fr: URL de base
vi: URL cơ sở
zh_hans: 基础 URL

# customProviders.basicInfo
source: Basic Information
fr: Informations de base
vi: Thông tin cơ bản
zh_hans: 基本信息

# customProviders.clearSelection
source: Clear
fr: Effacer
vi: Xóa
zh_hans: 清除

# customProviders.customHeaders
source: Custom Headers
fr: En-têtes personnalisés
vi: Headers tùy chỉnh
zh_hans: 自定义标头

# customProviders.customHeadersDesc
source: Add custom HTTP headers for API requests
fr: Ajouter des en-têtes HTTP personnalisés pour les requêtes API
vi: Thêm HTTP headers tùy chỉnh cho các yêu cầu API
zh_hans: 为 API 请求添加自定义 HTTP 标头

# customProviders.deleteConfirm
source: Delete Custom Provider
fr: Supprimer le fournisseur personnalisé
vi: Xóa nhà cung cấp tùy chỉnh
zh_hans: 删除自定义提供商

# customProviders.deleteMessage
source: Are you sure you want to delete this provider? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer ce fournisseur ? Cette action ne peut pas être annulée.
vi: Bạn có chắc muốn xóa nhà cung cấp này? Hành động này không thể hoàn tác.
zh_hans: 您确定要删除此提供商吗？此操作无法撤消。

# customProviders.deselectAll
source: Deselect All
fr: Tout désélectionner
vi: Bỏ chọn tất cả
zh_hans: 取消全选

# customProviders.disable
source: Disable
fr: Désactiver
vi: Tắt
zh_hans: 禁用

# customProviders.disabled
source: Disabled
fr: Désactivé
vi: Đã tắt
zh_hans: 已禁用

# customProviders.disabledNote
source: Disabled providers are not included in the proxy configuration
fr: Les fournisseurs désactivés ne sont pas inclus dans la configuration du proxy
vi: Nhà cung cấp bị tắt sẽ không được bao gồm trong cấu hình proxy
zh_hans: 禁用的提供商不会包含在代理配置中

# customProviders.edit
source: Edit Custom Provider
fr: Modifier le fournisseur personnalisé
vi: Sửa nhà cung cấp tùy chỉnh
zh_hans: 编辑自定义提供商

# customProviders.enable
source: Enable
fr: Activer
vi: Bật
zh_hans: 启用

# customProviders.enableProvider
source: Enable this provider
fr: Activer ce fournisseur
vi: Bật nhà cung cấp này
zh_hans: 启用此提供商

# customProviders.enterManually
source: Or enter model names manually:
fr: Ou saisissez les noms des modèles manuellement :
vi: Hoặc nhập tên mô hình thủ công:
zh_hans: 或手动输入模型名称：

# customProviders.error.headerNameDuplicate
source: Duplicate custom header names are not allowed
fr: Les noms d'en-têtes personnalisés en double ne sont pas autorisés
vi: Không được phép trùng tên header tùy chỉnh
zh_hans: 自定义标头名称不能重复

# customProviders.error.headerNameInvalid
source: Custom header names may only contain letters, digits, and the characters !#$%&'*+-.^_`|~
fr: Les noms d'en-têtes personnalisés ne peuvent contenir que des lettres, des chiffres et les caractères !#$%&'*+-.^_`|~
vi: Tên header tùy chỉnh chỉ được chứa chữ cái, chữ số và các ký tự !#$%&'*+-.^_`|~
zh_hans: 自定义标头名称只能包含字母、数字以及字符 !#$%&'*+-.^_`|~

# customProviders.error.headerValueInvalid
source: Custom header values must be printable ASCII, without line breaks or control characters
fr: Les valeurs d'en-têtes personnalisés doivent être en ASCII imprimable, sans saut de ligne ni caractère de contrôle
vi: Giá trị header tùy chỉnh phải là ký tự ASCII in được, không có ký tự xuống dòng hoặc ký tự điều khiển
zh_hans: 自定义标头值必须为可打印的 ASCII 字符，不能包含换行符或控制字符

# customProviders.fetchModels
source: Fetch Models
fr: Récupérer les modèles
vi: Tải mô hình
zh_hans: 获取模型

# customProviders.footer
source: Custom providers let you connect OpenRouter, Ollama, LM Studio, or any compatible API endpoint.
fr: Les fournisseurs personnalisés vous permettent de connecter OpenRouter, Ollama, LM Studio ou tout point d'accès API compatible.
vi: Nhà cung cấp tùy chỉnh cho phép bạn kết nối OpenRouter, Ollama, LM Studio, hoặc bất kỳ API endpoint tương thích nào.
zh_hans: 自定义提供商允许您连接 OpenRouter、Ollama、LM Studio 或任何兼容的 API 端点。

# customProviders.headerName
source: Header Name
fr: Nom de l'en-tête
vi: Tên header
zh_hans: 标头名称

# customProviders.headerValue
source: Header Value
fr: Valeur de l'en-tête
vi: Giá trị header
zh_hans: 标头值

# customProviders.key
source: key
fr: clé
vi: khóa
zh_hans: 密钥

# customProviders.keys
source: keys
fr: clés
vi: khóa
zh_hans: 密钥

# customProviders.limitModels
source: Limit models to selection
fr: Limiter les modèles à la sélection
vi: Giới hạn mô hình theo lựa chọn
zh_hans: 将模型限制为所选项

# customProviders.limitModelsDesc
source: Only selected models will be available via proxy
fr: Seuls les modèles sélectionnés seront disponibles via le proxy
vi: Chỉ các mô hình đã chọn mới khả dụng qua proxy
zh_hans: 只有所选模型会通过代理提供

# customProviders.localAlias
source: Local Alias
fr: Alias local
vi: Bí danh local
zh_hans: 本地别名

# customProviders.modelMapping
source: Model Mapping
fr: Mappage de modèles
vi: Ánh xạ mô hình
zh_hans: 模型映射

# customProviders.modelMappingDesc
source: Map upstream model names to local aliases
fr: Mapper les noms de modèles amont vers des alias locaux
vi: Ánh xạ tên mô hình upstream sang bí danh local
zh_hans: 将上游模型名称映射到本地别名

# customProviders.noHeaders
source: No custom headers configured.
fr: Aucun en-tête personnalisé configuré.
vi: Chưa cấu hình headers tùy chỉnh.
zh_hans: 未配置自定义标头。

# customProviders.noMappings
source: No model mappings configured. Models will use their original names.
fr: Aucun mappage de modèle configuré. Les modèles utiliseront leurs noms d'origine.
vi: Chưa cấu hình ánh xạ mô hình. Các mô hình sẽ sử dụng tên gốc.
zh_hans: 未配置模型映射。模型将使用其原始名称。

# customProviders.optional
source: Optional
fr: Optionnel
vi: Tùy chọn
zh_hans: 可选

# customProviders.popularModels
source: Popular Models
fr: Modèles populaires
vi: Mô hình phổ biến
zh_hans: 热门模型

# customProviders.prefix
source: Model Prefix
fr: Préfixe du modèle
vi: Tiền tố mô hình
zh_hans: 模型前缀

# customProviders.prefixHint
source: e.g., my-custom-prefix
fr: ex. my-custom-prefix
vi: vd. my-custom-prefix
zh_hans: 例如 my-custom-prefix

# customProviders.providerName
source: Provider Name
fr: Nom du fournisseur
vi: Tên nhà cung cấp
zh_hans: 提供商名称

# customProviders.providerType
source: Provider Type
fr: Type de fournisseur
vi: Loại nhà cung cấp
zh_hans: 提供商类型

# customProviders.proxyURL
source: Proxy URL (optional)
fr: URL du proxy (optionnel)
vi: URL Proxy (tùy chọn)
zh_hans: 代理 URL（可选）

# customProviders.saveChanges
source: Save Changes
fr: Enregistrer les modifications
vi: Lưu thay đổi
zh_hans: 保存更改

# customProviders.searchModels
source: Search models...
fr: Rechercher des modèles...
vi: Tìm kiếm mô hình...
zh_hans: 搜索模型...

# customProviders.selectAll
source: Select All
fr: Tout sélectionner
vi: Chọn tất cả
zh_hans: 全选

# customProviders.selectedModels
source: %lld models selected
fr: %lld modèles sélectionnés
vi: Đã chọn %lld mô hình
zh_hans: 已选择 %lld 个模型

# customProviders.selectModelsHint
source: Select models to make available via proxy
fr: Sélectionnez les modèles à rendre disponibles via le proxy
vi: Chọn các mô hình sẽ khả dụng qua proxy
zh_hans: 选择要通过代理提供的模型

# customProviders.testing
source: Testing connection...
fr: Test de la connexion...
vi: Đang kiểm tra kết nối...
zh_hans: 正在测试连接...

# customProviders.thinkingBudget
source: Thinking Budget
fr: Budget de réflexion
vi: Ngân sách suy nghĩ
zh_hans: 思考预算

# customProviders.thinkingBudgetHint
source: e.g., claude-sonnet-4(16000) or gemini-2.5-flash(max)
fr: ex. claude-sonnet-4(16000) ou gemini-2.5-flash(max)
vi: ví dụ: claude-sonnet-4(16000) hoặc gemini-2.5-flash(max)
zh_hans: 例如：claude-sonnet-4(16000) 或 gemini-2.5-flash(max)

# customProviders.title
source: Custom Providers
fr: Fournisseurs personnalisés
vi: Nhà cung cấp tùy chỉnh
zh_hans: 自定义提供商

# customProviders.type.claude
source: Claude Compatible
fr: Compatible Claude
vi: Tương thích Claude
zh_hans: Claude 兼容

# customProviders.type.claude.desc
source: Anthropic API or Claude-compatible providers
fr: API Anthropic ou fournisseurs compatibles Claude
vi: API Anthropic hoặc các nhà cung cấp tương thích Claude
zh_hans: Anthropic API 或 Claude 兼容提供商

# customProviders.type.clinepass.desc
source: ClinePass subscription with OpenAI-compatible routing
fr: Abonnement ClinePass avec routage compatible OpenAI
vi: Gói ClinePass với định tuyến tương thích OpenAI
zh_hans: 支持 OpenAI 兼容路由的 ClinePass 订阅

# customProviders.type.codex
source: Codex Compatible
fr: Compatible Codex
vi: Tương thích Codex
zh_hans: Codex 兼容

# customProviders.type.codex.desc
source: Custom Codex-compatible endpoints
fr: Points d'accès personnalisés compatibles Codex
vi: Các endpoint tương thích Codex tùy chỉnh
zh_hans: 自定义 Codex 兼容端点

# customProviders.type.gemini
source: Gemini Compatible
fr: Compatible Gemini
vi: Tương thích Gemini
zh_hans: Gemini 兼容

# customProviders.type.gemini.desc
source: Google Gemini API or Gemini-compatible providers
fr: API Google Gemini ou fournisseurs compatibles Gemini
vi: API Google Gemini hoặc các nhà cung cấp tương thích Gemini
zh_hans: Google Gemini API 或 Gemini 兼容提供商

# customProviders.type.glm
source: GLM Compatible
fr: Compatible GLM
vi: Tương thích GLM
zh_hans: GLM 兼容

# customProviders.type.glm.desc
source: GLM API
fr: API GLM
vi: API GLM

# customProviders.type.openai
source: OpenAI Compatible
fr: Compatible OpenAI
vi: Tương thích OpenAI
zh_hans: OpenAI 兼容

# customProviders.type.openai.desc
source: OpenRouter, Ollama, LM Studio, vLLM, or any OpenAI-compatible API
fr: OpenRouter, Ollama, LM Studio, vLLM ou toute API compatible OpenAI
vi: OpenRouter, Ollama, LM Studio, vLLM, hoặc bất kỳ API tương thích OpenAI nào
zh_hans: OpenRouter、Ollama、LM Studio、vLLM 或任何 OpenAI 兼容 API

# customProviders.upstreamModel
source: Upstream Model
fr: Modèle amont
vi: Mô hình upstream
zh_hans: 上游模型

# customProviders.validationError
source: Validation Error
fr: Erreur de validation
vi: Lỗi xác thực
zh_hans: 验证错误

# dashboard.accounts
source: Accounts
fr: Comptes
vi: Tài khoản
zh_hans: 账户

# dashboard.addAccountsHint
source: Add provider accounts to start tracking quotas
fr: Ajoutez des comptes fournisseur pour commencer à suivre les quotas
vi: Thêm tài khoản nhà cung cấp để bắt đầu theo dõi quota
zh_hans: 添加提供商账户以开始跟踪配额

# dashboard.apiEndpoint
source: API Endpoint
fr: Point d'accès API
vi: Điểm cuối API
zh_hans: API 端点

# dashboard.availableModels
source: Available Models
fr: Modèles disponibles
vi: Mô hình khả dụng
zh_hans: 可用模型

# dashboard.clickToInstall
source: Click the button below to automatically download and install
fr: Cliquez sur le bouton ci-dessous pour télécharger et installer automatiquement
vi: Nhấn nút bên dưới để tự động tải và cài đặt
zh_hans: 点击下方按钮自动下载并安装

# dashboard.cliNotInstalled
source: CLIProxyAPI Not Installed
fr: CLIProxyAPI non installé
vi: CLIProxyAPI chưa cài đặt
zh_hans: CLIProxyAPI 未安装

# dashboard.connected
source: connected
fr: connecté
vi: đã kết nối
zh_hans: 已连接

# dashboard.connectingToRemote
source: Connecting to remote server...
fr: Connexion au serveur distant...
vi: Đang kết nối máy chủ từ xa...
zh_hans: 正在连接远程服务器...

# dashboard.failed
source: failed
fr: échoué
vi: thất bại
zh_hans: 失败

# dashboard.gettingStarted
source: Getting Started
fr: Démarrage
vi: Bắt đầu
zh_hans: 入门

# dashboard.installCLI
source: Install CLIProxyAPI
fr: Installer CLIProxyAPI
vi: Cài đặt CLIProxyAPI
zh_hans: 安装 CLIProxyAPI

# dashboard.lastConnected
source: Last Connected
fr: Dernière connexion
vi: Kết nối lần cuối
zh_hans: 上次连接

# dashboard.lastRefresh
source: Last Refresh
fr: Dernière actualisation
vi: Cập nhật lần cuối
zh_hans: 上次刷新

# dashboard.lowestQuota
source: Lowest Quota
fr: Quota le plus bas
vi: Quota thấp nhất
zh_hans: 最低配额

# dashboard.noAccountsTracked
source: No accounts tracked
fr: Aucun compte suivi
vi: Chưa theo dõi tài khoản nào
zh_hans: 未跟踪账户

# dashboard.noQuotaData
source: No quota data yet
fr: Pas encore de données de quota
vi: Chưa có dữ liệu quota
zh_hans: 暂无配额数据

# dashboard.processed
source: processed
fr: traités
vi: đã xử lý
zh_hans: 已处理

# dashboard.providers
source: Providers
fr: Fournisseurs
vi: Nhà cung cấp
zh_hans: 提供商

# dashboard.quotaOverview
source: Quota Overview
fr: Aperçu des quotas
vi: Tổng quan Quota
zh_hans: 配额概览

# dashboard.ready
source: ready
fr: prêt
vi: sẵn sàng
zh_hans: 就绪

# dashboard.remaining
source: remaining
fr: restant
vi: còn lại
zh_hans: 剩余

# dashboard.remoteDisconnected
source: Remote Disconnected
fr: Déconnecté du serveur distant
vi: Đã ngắt kết nối từ xa
zh_hans: 远程已断开

# dashboard.remoteDisconnectedDesc
source: Connection to the remote server was lost. Check your network or server status.
fr: La connexion au serveur distant a été perdue. Vérifiez votre réseau ou l'état du serveur.
vi: Mất kết nối đến máy chủ từ xa. Kiểm tra mạng hoặc trạng thái máy chủ.
zh_hans: 与远程服务器的连接已丢失。请检查网络或服务器状态。

# dashboard.remoteEndpoint
source: Remote Endpoint
fr: Point d'accès distant
vi: Điểm cuối từ xa
zh_hans: 远程端点

# dashboard.remoteMode
source: Remote Mode
fr: Mode distant
vi: Chế độ từ xa
zh_hans: 远程模式

# dashboard.requests
source: Requests
fr: Requêtes
vi: Yêu cầu
zh_hans: 请求

# dashboard.startToBegin
source: Start the proxy server to begin
fr: Démarrez le serveur proxy pour commencer
vi: Khởi động máy chủ proxy để bắt đầu
zh_hans: 启动代理服务器以开始

# dashboard.successRate
source: Success Rate
fr: Taux de réussite
vi: Tỷ lệ thành công
zh_hans: 成功率

# dashboard.tokens
source: Tokens
fr: Jetons
vi: Token
zh_hans: 令牌

# dashboard.trackedAccounts
source: Tracked Accounts
fr: Comptes suivis
vi: Tài khoản theo dõi
zh_hans: 跟踪的账户

# dashboard.updated
source: updated
fr: mis à jour
vi: đã cập nhật
zh_hans: 已更新

source: Display Mode
fr: Mode d'affichage
vi: Chế độ hiển thị
zh_hans: 显示模式

# empty.addProviderAccounts
source: Add provider accounts to view quota
fr: Ajoutez des comptes fournisseur pour voir le quota
vi: Thêm tài khoản nhà cung cấp để xem hạn mức
zh_hans: 添加提供商账户以查看配额

# empty.noAccounts
source: No Accounts
fr: Aucun compte
vi: Chưa có tài khoản
zh_hans: 无账户

# empty.noQuotaData
source: No Quota Data
fr: Aucune donnée de quota
vi: Chưa có dữ liệu Quota
zh_hans: 无配额数据

# empty.proxyNotRunning
source: Proxy Not Running
fr: Proxy non démarré
vi: Proxy chưa chạy
zh_hans: 代理未运行

# empty.refreshToLoad
source: Refresh to load quota information
fr: Actualisez pour charger les informations de quota
vi: Làm mới để tải thông tin quota
zh_hans: 刷新以加载配额信息

source: Error
fr: Erreur
vi: Lỗi
zh_hans: 错误

# factory.apiKey.hint
source: Stored securely in Keychain and never shown again.
fr: Stockée en toute sécurité dans le trousseau et ne sera plus jamais affichée.
vi: Được lưu an toàn trong Keychain và không hiển thị lại.
zh_hans: 安全存储在钥匙串中，之后不会再次显示。

# factory.apiKey.label
source: Factory API Key
fr: Clé API Factory
zh_hans: Factory API 密钥

# factory.apiKey.placeholder
source: Enter your Factory API key
fr: Saisissez votre clé API Factory
vi: Nhập Factory API key
zh_hans: 输入您的 Factory API 密钥

# factory.apiKey.rotateHint
source: Enter a replacement key. The current key is never revealed.
fr: Saisissez une clé de remplacement. La clé actuelle n’est jamais révélée.
vi: Nhập key thay thế. Key hiện tại không bao giờ được hiển thị.
zh_hans: 输入替换密钥。当前密钥绝不会显示。

# factory.connection.edit
source: Rotate Factory Droid Key
fr: Remplacer la clé Factory Droid
vi: Thay Factory Droid Key
zh_hans: 更换 Factory Droid 密钥

# factory.connection.subtitle
source: Monitor Factory Droid limits without proxy routing
fr: Surveillez les limites de Factory Droid sans routage proxy
vi: Theo dõi giới hạn Factory Droid, không dùng proxy routing
zh_hans: 无需代理路由即可监控 Factory Droid 限额

# factory.connection.title
source: Connect Factory Droid
fr: Connecter Factory Droid
vi: Kết nối Factory Droid
zh_hans: 连接 Factory Droid

# factory.label.placeholder
source: Account label
fr: Libellé du compte
vi: Nhãn tài khoản
zh_hans: 账户标签

# factory.quota.billingMode
source: Billing Mode
fr: Mode de facturation
vi: Chế độ thanh toán
zh_hans: 计费模式

# factory.quota.coreFiveHour
source: 5-hour
fr: 5 heures
vi: 5 giờ
zh_hans: 5 小时

# factory.quota.coreMonthly
source: Monthly
fr: Mensuel
vi: Hàng tháng
zh_hans: 每月

# factory.quota.coreWeekly
source: Weekly
fr: Hebdomadaire
vi: Hàng tuần
zh_hans: 每周

# factory.quota.standardFiveHour
source: 5-hour
fr: 5 heures
vi: 5 giờ
zh_hans: 5 小时

# factory.quota.standardMonthly
source: Monthly
fr: Mensuel
vi: Hàng tháng
zh_hans: 每月

# factory.quota.standardWeekly
source: Weekly
fr: Hebdomadaire
vi: Hàng tuần
zh_hans: 每周

# factory.status.legacyBilling
source: Legacy billing
fr: Facturation héritée
vi: Thanh toán kiểu cũ
zh_hans: 旧版计费

source: Generating preview...
fr: Génération de l'aperçu...
vi: Đang tạo bản xem trước...
zh_hans: 正在生成预览...

# glm.add
source: Add GLM Provider
fr: Ajouter un fournisseur GLM
vi: Thêm nhà cung cấp GLM
zh_hans: 添加 GLM 提供商

# glm.addProvider
source: Add Provider
fr: Ajouter un fournisseur
vi: Thêm nhà cung cấp
zh_hans: 添加提供商

# glm.apiKey
source: API Key
fr: Clé API
vi: Khóa API
zh_hans: API 密钥

# glm.description
source: Add your GLM API key to track quota usage
fr: Ajoutez votre clé API GLM pour suivre l'utilisation du quota
vi: Thêm khóa API GLM của bạn để theo dõi mức sử dụng quota
zh_hans: 添加您的 GLM API 密钥以跟踪配额使用情况

# glm.edit
source: Edit GLM Provider
fr: Modifier le fournisseur GLM
vi: Chỉnh sửa nhà cung cấp GLM
zh_hans: 编辑 GLM 提供商

# glm.endpoint
source: Endpoint
fr: Point de terminaison
vi: Điểm cuối
zh_hans: 端点

# glm.endpoint.zaiGlobal
source: Z.ai Global
fr: Z.ai mondial
vi: Z.ai Toàn cầu
zh_hans: Z.ai 全球

# glm.endpointHint
source: Select the GLM API endpoint
fr: Sélectionnez le point de terminaison de l'API GLM
vi: Chọn điểm cuối API GLM
zh_hans: 选择 GLM API 端点

# glm.error.emptyApiKey
source: API Key cannot be empty
fr: La clé API ne peut pas être vide
vi: Khóa API không được để trống
zh_hans: API 密钥不能为空

# glm.saveChanges
source: Save Changes
fr: Enregistrer les modifications
vi: Lưu thay đổi
zh_hans: 保存更改

# glm.validationError
source: Validation Error
fr: Erreur de validation
vi: Lỗi xác thực
zh_hans: 验证错误

# grok.status.cap
source: %@ cap
fr: Plafond de %@
vi: Giới hạn %@
zh_hans: %@ 上限

# grok.status.disabled
source: Disabled
fr: Désactivé
vi: Đã tắt
zh_hans: 已停用

# ideScan.cliTools
source: CLI Tools (claude, codex, gemini...)
fr: Outils CLI (claude, codex, gemini...)
vi: Công cụ CLI (claude, codex, gemini...)
zh_hans: CLI 工具（claude、codex、gemini...）

# ideScan.cliTools.detail
source: Uses 'which' command to find installed tools
fr: Utilise la commande 'which' pour trouver les outils installés
vi: Sử dụng lệnh 'which' để tìm công cụ đã cài
zh_hans: 使用 'which' 命令查找已安装的工具

# ideScan.complete
source: Scan Complete
fr: Analyse terminée
vi: Quét hoàn tất
zh_hans: 扫描完成

# ideScan.cursor.detail
source: Reads ~/Library/Application Support/Cursor/
fr: Lit ~/Library/Application Support/Cursor/
vi: Đọc ~/Library/Application Support/Cursor/
zh_hans: 读取 ~/Library/Application Support/Cursor/

# ideScan.error
source: Scan Error
fr: Erreur d'analyse
vi: Lỗi quét
zh_hans: 扫描错误

# ideScan.notFound
source: Not found
fr: Non trouvé
vi: Không tìm thấy
zh_hans: 未找到

# ideScan.privacyDescription
source: This will access files from other applications to detect installed IDEs and their authentication status. No data is sent externally.
fr: Cela accédera aux fichiers d'autres applications pour détecter les IDE installés et leur état d'authentification. Aucune donnée n'est envoyée à l'extérieur.
vi: Thao tác này sẽ truy cập file từ các ứng dụng khác để phát hiện IDE đã cài đặt và trạng thái xác thực. Không có dữ liệu nào được gửi ra ngoài.
zh_hans: 这将访问其他应用程序的文件以检测已安装的 IDE 及其认证状态。不会对外发送任何数据。

# ideScan.privacyNotice
source: Privacy Notice
fr: Avis de confidentialité
vi: Thông báo bảo mật
zh_hans: 隐私通知

# ideScan.scanExisting
source: Scan for Existing IDEs
fr: Rechercher les IDE existants
vi: Quét IDE đã cài đặt
zh_hans: 扫描已安装的 IDE

# ideScan.scanning
source: Scanning...
fr: Analyse en cours...
vi: Đang quét...
zh_hans: 扫描中...

# ideScan.scanNow
source: Scan Now
fr: Analyser maintenant
vi: Quét ngay
zh_hans: 立即扫描

# ideScan.selectSources
source: Select Data Sources
fr: Sélectionner les sources de données
vi: Chọn nguồn dữ liệu
zh_hans: 选择数据源

# ideScan.subtitle
source: Detect IDEs and CLI tools to track their quotas
fr: Détecter les IDE et les outils CLI pour suivre leurs quotas
vi: Phát hiện IDE và công cụ CLI để theo dõi quota
zh_hans: 检测 IDE 和 CLI 工具以跟踪其配额

# ideScan.title
source: Scan for Installed IDEs
fr: Rechercher les IDE installés
vi: Quét IDE đã cài đặt
zh_hans: 扫描已安装的 IDE

# ideScan.trae.detail
source: Reads ~/Library/Application Support/Trae/
fr: Lit ~/Library/Application Support/Trae/
vi: Đọc ~/Library/Application Support/Trae/
zh_hans: 读取 ~/Library/Application Support/Trae/

source: Last checked
fr: Dernière vérification
vi: Kiểm tra lần cuối
zh_hans: 上次检查

# launchAtLogin.error.notInApplicationsFolder
source: The app must be in the Applications folder to enable Launch at Login.
fr: L'application doit être dans le dossier Applications pour activer le lancement à la connexion.
vi: Ứng dụng phải nằm trong thư mục Applications để bật khởi động cùng hệ thống.
zh_hans: 应用程序必须在应用程序文件夹中才能启用登录时启动。

# launchAtLogin.error.registrationFailed
source: Failed to register the app for launch at login. Please try again.
fr: Échec de l'enregistrement de l'application pour le lancement à la connexion. Veuillez réessayer.
vi: Không thể đăng ký ứng dụng để khởi động cùng hệ thống. Vui lòng thử lại.
zh_hans: 无法注册应用程序在登录时启动。请重试。
